luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/**
 * \file IfxMsc_bf.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XC_UM_V2.2.R1
 * Specification: tc27xC_um_v2.2_SFR.xml (Revision: UM_V2.2)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Msc_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Msc
 * 
 */
#ifndef IFXMSC_BF_H
#define IFXMSC_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Msc_BitfieldsMask
 * \{  */

/** \brief  Length for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.ABB */
#define IFX_MSC_ABC_ABB_OFF (31u)

/** \brief  Length for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_LEN (3u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_MSK (0x7u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.CLKSEL */
#define IFX_MSC_ABC_CLKSEL_OFF (27u)

/** \brief  Length for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_LEN (4u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_OFF (4u)

/** \brief  Length for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_LEN (4u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_OFF (0u)

/** \brief  Length for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_LEN (3u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_MSK (0x7u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.NDA */
#define IFX_MSC_ABC_NDA_OFF (16u)

/** \brief  Length for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_OFF (10u)

/** \brief  Length for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_LEN (2u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.OFM */
#define IFX_MSC_ABC_OFM_OFF (13u)

/** \brief  Length for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.OIE */
#define IFX_MSC_ABC_OIE_OFF (15u)

/** \brief  Length for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_OFF (8u)

/** \brief  Length for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_OFF (12u)

/** \brief  Length for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.UASR */
#define IFX_MSC_ABC_UASR_OFF (21u)

/** \brief  Length for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_LEN (2u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.UFM */
#define IFX_MSC_ABC_UFM_OFF (24u)

/** \brief  Length for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.UIE */
#define IFX_MSC_ABC_UIE_OFF (26u)

/** \brief  Length for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.UIP */
#define IFX_MSC_ABC_UIP_OFF (19u)

/** \brief  Length for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_LEN (1u)

/** \brief  Mask for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ABC_Bits.UNF */
#define IFX_MSC_ABC_UNF_OFF (23u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN0 */
#define IFX_MSC_ACCEN0_EN0_OFF (0u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN10 */
#define IFX_MSC_ACCEN0_EN10_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN10 */
#define IFX_MSC_ACCEN0_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN10 */
#define IFX_MSC_ACCEN0_EN10_OFF (10u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN11 */
#define IFX_MSC_ACCEN0_EN11_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN11 */
#define IFX_MSC_ACCEN0_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN11 */
#define IFX_MSC_ACCEN0_EN11_OFF (11u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN12 */
#define IFX_MSC_ACCEN0_EN12_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN12 */
#define IFX_MSC_ACCEN0_EN12_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN12 */
#define IFX_MSC_ACCEN0_EN12_OFF (12u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN13 */
#define IFX_MSC_ACCEN0_EN13_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN13 */
#define IFX_MSC_ACCEN0_EN13_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN13 */
#define IFX_MSC_ACCEN0_EN13_OFF (13u)

