luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN7 */
#define IFX_MSC_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN8 */
#define IFX_MSC_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ACCEN0_Bits.EN9 */
#define IFX_MSC_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_CLC_Bits.DISR */
#define IFX_MSC_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_CLC_Bits.DISS */
#define IFX_MSC_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_CLC_Bits.EDIS */
#define IFX_MSC_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_LEN (16u)

/** \brief  Mask for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DC_Bits.DCH */
#define IFX_MSC_DC_DCH_OFF (16u)

/** \brief  Length for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_LEN (16u)

/** \brief  Mask for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DC_Bits.DCL */
#define IFX_MSC_DC_DCL_OFF (0u)

/** \brief  Length for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_LEN (16u)

/** \brief  Mask for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DD_Bits.DDH */
#define IFX_MSC_DD_DDH_OFF (16u)

/** \brief  Length for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_LEN (16u)

/** \brief  Mask for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DD_Bits.DDL */
#define IFX_MSC_DD_DDL_OFF (0u)

/** \brief  Length for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_LEN (16u)

/** \brief  Mask for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_OFF (16u)

/** \brief  Length for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_LEN (16u)

/** \brief  Mask for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_OFF (0u)

/** \brief  Length for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_LEN (16u)

/** \brief  Mask for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_OFF (16u)

/** \brief  Length for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_LEN (16u)

/** \brief  Mask for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_OFF (0u)

/** \brief  Length for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.CP */
#define IFX_MSC_DSC_CP_OFF (1u)

/** \brief  Length for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.DP */
#define IFX_MSC_DSC_DP_OFF (2u)

/** \brief  Length for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.DSDIS */
#define IFX_MSC_DSC_DSDIS_OFF (15u)

/** \brief  Length for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.ENSELH */
#define IFX_MSC_DSC_ENSELH_OFF (14u)

/** \brief  Length for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.ENSELL */
#define IFX_MSC_DSC_ENSELL_OFF (13u)

/** \brief  Length for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_LEN (6u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_MSK (0x3fu)

/** \brief  Offset for Ifx_MSC_DSC_Bits.NBC */
#define IFX_MSC_DSC_NBC_OFF (16u)

/** \brief  Length for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_LEN (5u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_MSK (0x1fu)

/** \brief  Offset for Ifx_MSC_DSC_Bits.NDBH */
#define IFX_MSC_DSC_NDBH_OFF (8u)

/** \brief  Length for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_LEN (5u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_MSK (0x1fu)

/** \brief  Offset for Ifx_MSC_DSC_Bits.NDBL */
#define IFX_MSC_DSC_NDBL_OFF (3u)

/** \brief  Length for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_LEN (5u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_MSK (0x1fu)

/** \brief  Offset for Ifx_MSC_DSC_Bits.PPD */
#define IFX_MSC_DSC_PPD_OFF (24u)

/** \brief  Length for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSC_Bits.TM */
#define IFX_MSC_DSC_TM_OFF (0u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_LEN (1u)

