luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_OFF (15u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.CDCM */
#define IFX_MSC_DSCE_CDCM_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.CDCM */
#define IFX_MSC_DSCE_CDCM_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.CDCM */
#define IFX_MSC_DSCE_CDCM_OFF (31u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_OFF (14u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_OFF (16u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.INJENP1 */
#define IFX_MSC_DSCE_INJENP1_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.INJENP1 */
#define IFX_MSC_DSCE_INJENP1_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.INJENP1 */
#define IFX_MSC_DSCE_INJENP1_OFF (24u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.INJPOSP0 */
#define IFX_MSC_DSCE_INJPOSP0_LEN (6u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.INJPOSP0 */
#define IFX_MSC_DSCE_INJPOSP0_MSK (0x3fu)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.INJPOSP0 */
#define IFX_MSC_DSCE_INJPOSP0_OFF (17u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.INJPOSP1 */
#define IFX_MSC_DSCE_INJPOSP1_LEN (6u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.INJPOSP1 */
#define IFX_MSC_DSCE_INJPOSP1_MSK (0x3fu)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.INJPOSP1 */
#define IFX_MSC_DSCE_INJPOSP1_OFF (25u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_OFF (0u)

/** \brief  Length for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_OFF (1u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH0 */
#define IFX_MSC_DSDSH_SH0_OFF (0u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH10 */
#define IFX_MSC_DSDSH_SH10_OFF (20u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH11 */
#define IFX_MSC_DSDSH_SH11_OFF (22u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH12 */
#define IFX_MSC_DSDSH_SH12_OFF (24u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH13 */
#define IFX_MSC_DSDSH_SH13_OFF (26u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH14 */
#define IFX_MSC_DSDSH_SH14_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH14 */
#define IFX_MSC_DSDSH_SH14_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH14 */
#define IFX_MSC_DSDSH_SH14_OFF (28u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH15 */
#define IFX_MSC_DSDSH_SH15_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH15 */
#define IFX_MSC_DSDSH_SH15_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH15 */
#define IFX_MSC_DSDSH_SH15_OFF (30u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH1 */
#define IFX_MSC_DSDSH_SH1_OFF (2u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH2 */
#define IFX_MSC_DSDSH_SH2_OFF (4u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH3 */
#define IFX_MSC_DSDSH_SH3_OFF (6u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH4 */
#define IFX_MSC_DSDSH_SH4_OFF (8u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH5 */
#define IFX_MSC_DSDSH_SH5_OFF (10u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH6 */
#define IFX_MSC_DSDSH_SH6_OFF (12u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH7 */
#define IFX_MSC_DSDSH_SH7_OFF (14u)

/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH8 */
#define IFX_MSC_DSDSH_SH8_OFF (16u)

