luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Length for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSH_Bits.SH9 */
#define IFX_MSC_DSDSH_SH9_OFF (18u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH16 */
#define IFX_MSC_DSDSHE_SH16_OFF (0u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH17 */
#define IFX_MSC_DSDSHE_SH17_OFF (2u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH18 */
#define IFX_MSC_DSDSHE_SH18_OFF (4u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH19 */
#define IFX_MSC_DSDSHE_SH19_OFF (6u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH20 */
#define IFX_MSC_DSDSHE_SH20_OFF (8u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH21 */
#define IFX_MSC_DSDSHE_SH21_OFF (10u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH22 */
#define IFX_MSC_DSDSHE_SH22_OFF (12u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH23 */
#define IFX_MSC_DSDSHE_SH23_OFF (14u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH24 */
#define IFX_MSC_DSDSHE_SH24_OFF (16u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH25 */
#define IFX_MSC_DSDSHE_SH25_OFF (18u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH26 */
#define IFX_MSC_DSDSHE_SH26_OFF (20u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH27 */
#define IFX_MSC_DSDSHE_SH27_OFF (22u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH28 */
#define IFX_MSC_DSDSHE_SH28_OFF (24u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH29 */
#define IFX_MSC_DSDSHE_SH29_OFF (26u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH30 */
#define IFX_MSC_DSDSHE_SH30_OFF (28u)

/** \brief  Length for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSHE_Bits.SH31 */
#define IFX_MSC_DSDSHE_SH31_OFF (30u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL0 */
#define IFX_MSC_DSDSL_SL0_OFF (0u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL10 */
#define IFX_MSC_DSDSL_SL10_OFF (20u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL11 */
#define IFX_MSC_DSDSL_SL11_OFF (22u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL12 */
#define IFX_MSC_DSDSL_SL12_OFF (24u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL13 */
#define IFX_MSC_DSDSL_SL13_OFF (26u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL14 */
#define IFX_MSC_DSDSL_SL14_OFF (28u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_OFF (30u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_OFF (2u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_LEN (2u)

