luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_OFF (4u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_OFF (6u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_OFF (8u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_OFF (10u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_OFF (12u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_OFF (14u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_OFF (16u)

/** \brief  Length for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_OFF (18u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_OFF (0u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_OFF (2u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_OFF (4u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_OFF (6u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_OFF (8u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_OFF (10u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_OFF (12u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_OFF (14u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_OFF (16u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_OFF (18u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_OFF (20u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_OFF (22u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_OFF (24u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_OFF (26u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL30 */
#define IFX_MSC_DSDSLE_SL30_OFF (28u)

/** \brief  Length for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSDSLE_Bits.SL31 */
#define IFX_MSC_DSDSLE_SL31_OFF (30u)

/** \brief  Length for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_LEN (1u)

