luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSS_Bits.CFA */
#define IFX_MSC_DSS_CFA_OFF (25u)

/** \brief  Length for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_LEN (8u)

/** \brief  Mask for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_MSK (0xffu)

/** \brief  Offset for Ifx_MSC_DSS_Bits.DC */
#define IFX_MSC_DSS_DC_OFF (16u)

/** \brief  Length for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_LEN (1u)

/** \brief  Mask for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_DSS_Bits.DFA */
#define IFX_MSC_DSS_DFA_OFF (24u)

/** \brief  Length for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_LEN (4u)

/** \brief  Mask for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_DSS_Bits.NPTF */
#define IFX_MSC_DSS_NPTF_OFF (8u)

/** \brief  Length for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_LEN (4u)

/** \brief  Mask for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_DSS_Bits.PFC */
#define IFX_MSC_DSS_PFC_OFF (0u)

/** \brief  Length for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_LEN (4u)

/** \brief  Mask for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_OFF (8u)

/** \brief  Length for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_LEN (6u)

/** \brief  Mask for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_MSK (0x3fu)

/** \brief  Offset for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_OFF (2u)

/** \brief  Length for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_LEN (2u)

/** \brief  Mask for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_OFF (0u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH0 */
#define IFX_MSC_ESR_ENH0_OFF (16u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH10 */
#define IFX_MSC_ESR_ENH10_OFF (26u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH11 */
#define IFX_MSC_ESR_ENH11_OFF (27u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH12 */
#define IFX_MSC_ESR_ENH12_OFF (28u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH13 */
#define IFX_MSC_ESR_ENH13_OFF (29u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH14 */
#define IFX_MSC_ESR_ENH14_OFF (30u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH15 */
#define IFX_MSC_ESR_ENH15_OFF (31u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH1 */
#define IFX_MSC_ESR_ENH1_OFF (17u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH2 */
#define IFX_MSC_ESR_ENH2_OFF (18u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH3 */
#define IFX_MSC_ESR_ENH3_OFF (19u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH4 */
#define IFX_MSC_ESR_ENH4_OFF (20u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH5 */
#define IFX_MSC_ESR_ENH5_OFF (21u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH6 */
#define IFX_MSC_ESR_ENH6_OFF (22u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH7 */
#define IFX_MSC_ESR_ENH7_OFF (23u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH8 */
#define IFX_MSC_ESR_ENH8_OFF (24u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENH9 */
#define IFX_MSC_ESR_ENH9_OFF (25u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_LEN (1u)

