luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL0 */
#define IFX_MSC_ESR_ENL0_OFF (0u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL10 */
#define IFX_MSC_ESR_ENL10_OFF (10u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL11 */
#define IFX_MSC_ESR_ENL11_OFF (11u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL12 */
#define IFX_MSC_ESR_ENL12_OFF (12u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL13 */
#define IFX_MSC_ESR_ENL13_OFF (13u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL14 */
#define IFX_MSC_ESR_ENL14_OFF (14u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL15 */
#define IFX_MSC_ESR_ENL15_OFF (15u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL1 */
#define IFX_MSC_ESR_ENL1_OFF (1u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL2 */
#define IFX_MSC_ESR_ENL2_OFF (2u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL3 */
#define IFX_MSC_ESR_ENL3_OFF (3u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL4 */
#define IFX_MSC_ESR_ENL4_OFF (4u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL5 */
#define IFX_MSC_ESR_ENL5_OFF (5u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL6 */
#define IFX_MSC_ESR_ENL6_OFF (6u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL7 */
#define IFX_MSC_ESR_ENL7_OFF (7u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL8 */
#define IFX_MSC_ESR_ENL8_OFF (8u)

/** \brief  Length for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESR_Bits.ENL9 */
#define IFX_MSC_ESR_ENL9_OFF (9u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_OFF (16u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_OFF (17u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_OFF (18u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_OFF (19u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_OFF (20u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_OFF (21u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_OFF (22u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_OFF (23u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_LEN (1u)

