luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_OFF (24u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_OFF (25u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_OFF (26u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_OFF (27u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_OFF (28u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_OFF (29u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_OFF (30u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_OFF (31u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL16 */
#define IFX_MSC_ESRE_ENL16_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL16 */
#define IFX_MSC_ESRE_ENL16_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL16 */
#define IFX_MSC_ESRE_ENL16_OFF (0u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL17 */
#define IFX_MSC_ESRE_ENL17_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL17 */
#define IFX_MSC_ESRE_ENL17_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL17 */
#define IFX_MSC_ESRE_ENL17_OFF (1u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL18 */
#define IFX_MSC_ESRE_ENL18_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL18 */
#define IFX_MSC_ESRE_ENL18_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL18 */
#define IFX_MSC_ESRE_ENL18_OFF (2u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL19 */
#define IFX_MSC_ESRE_ENL19_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL19 */
#define IFX_MSC_ESRE_ENL19_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL19 */
#define IFX_MSC_ESRE_ENL19_OFF (3u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_OFF (4u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_OFF (5u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_OFF (6u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_OFF (7u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_OFF (8u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_OFF (9u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_OFF (10u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_OFF (11u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_OFF (12u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_OFF (13u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_LEN (1u)

/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_OFF (14u)

/** \brief  Length for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_LEN (1u)

