luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Mask for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_OFF (15u)

/** \brief  Length for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_LEN (1u)

/** \brief  Mask for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_FDR_Bits.DISCLK */
#define IFX_MSC_FDR_DISCLK_OFF (31u)

/** \brief  Length for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_LEN (2u)

/** \brief  Mask for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_FDR_Bits.DM */
#define IFX_MSC_FDR_DM_OFF (14u)

/** \brief  Length for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_LEN (1u)

/** \brief  Mask for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_FDR_Bits.ENHW */
#define IFX_MSC_FDR_ENHW_OFF (30u)

/** \brief  Length for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_LEN (10u)

/** \brief  Mask for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_MSC_FDR_Bits.RESULT */
#define IFX_MSC_FDR_RESULT_OFF (16u)

/** \brief  Length for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_LEN (10u)

/** \brief  Mask for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_MSC_FDR_Bits.STEP */
#define IFX_MSC_FDR_STEP_OFF (0u)

/** \brief  Length for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_LEN (1u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.ECIE */
#define IFX_MSC_ICR_ECIE_OFF (7u)

/** \brief  Length for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.ECIP */
#define IFX_MSC_ICR_ECIP_OFF (4u)

/** \brief  Length for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.EDIE */
#define IFX_MSC_ICR_EDIE_OFF (2u)

/** \brief  Length for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.EDIP */
#define IFX_MSC_ICR_EDIP_OFF (0u)

/** \brief  Length for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.RDIE */
#define IFX_MSC_ICR_RDIE_OFF (14u)

/** \brief  Length for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.RDIP */
#define IFX_MSC_ICR_RDIP_OFF (12u)

/** \brief  Length for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_LEN (1u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.TFIE */
#define IFX_MSC_ICR_TFIE_OFF (11u)

/** \brief  Length for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_ICR_Bits.TFIP */
#define IFX_MSC_ICR_TFIP_OFF (8u)

/** \brief  Length for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_MSC_ID_Bits.MODNUMBER */
#define IFX_MSC_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_MSC_ID_Bits.MODREV */
#define IFX_MSC_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_MSC_ID_Bits.MODTYPE */
#define IFX_MSC_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_OFF (5u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_OFF (6u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CDECI */
#define IFX_MSC_ISC_CDECI_OFF (1u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CDEDI */
#define IFX_MSC_ISC_CDEDI_OFF (0u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_OFF (4u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_OFF (2u)

/** \brief  Length for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_OFF (3u)

/** \brief  Length for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_LEN (1u)

/** \brief  Mask for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_OFF (21u)

