luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_bf.h
/** \brief  Length for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_OCS_Bits.SUS_P */
#define IFX_MSC_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_OCS_Bits.SUSSTA */
#define IFX_MSC_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_LEN (1u)

/** \brief  Mask for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_UD_Bits.C */
#define IFX_MSC_UD_C_OFF (18u)

/** \brief  Length for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_LEN (8u)

/** \brief  Mask for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_MSK (0xffu)

/** \brief  Offset for Ifx_MSC_UD_Bits.DATA */
#define IFX_MSC_UD_DATA_OFF (0u)

/** \brief  Length for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_LEN (1u)

/** \brief  Mask for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_UD_Bits.IPF */
#define IFX_MSC_UD_IPF_OFF (21u)

/** \brief  Length for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_LEN (2u)

/** \brief  Mask for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_UD_Bits.LABF */
#define IFX_MSC_UD_LABF_OFF (19u)

/** \brief  Length for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_LEN (1u)

/** \brief  Mask for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_UD_Bits.P */
#define IFX_MSC_UD_P_OFF (17u)

/** \brief  Length for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_LEN (1u)

/** \brief  Mask for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_UD_Bits.PERR */
#define IFX_MSC_UD_PERR_OFF (22u)

/** \brief  Length for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_LEN (1u)

/** \brief  Mask for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_UD_Bits.V */
#define IFX_MSC_UD_V_OFF (16u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_LEN (1u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTC */
#define IFX_MSC_USCE_USTC_OFF (10u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_LEN (1u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTF */
#define IFX_MSC_USCE_USTF_OFF (9u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_LEN (1u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTOEN */
#define IFX_MSC_USCE_USTOEN_OFF (8u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_LEN (2u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_MSK (0x3u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTOIP */
#define IFX_MSC_USCE_USTOIP_OFF (14u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_LEN (4u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTOPRE */
#define IFX_MSC_USCE_USTOPRE_OFF (0u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_LEN (4u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_MSK (0xfu)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTOVAL */
#define IFX_MSC_USCE_USTOVAL_OFF (4u)

/** \brief  Length for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_LEN (1u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.USTS */
#define IFX_MSC_USCE_USTS_OFF (11u)

/** \brief  Length for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_LEN (1u)

/** \brief  Mask for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USCE_Bits.UTASR */
#define IFX_MSC_USCE_UTASR_OFF (13u)

/** \brief  Length for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_LEN (1u)

/** \brief  Mask for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USR_Bits.PCTR */
#define IFX_MSC_USR_PCTR_OFF (4u)

/** \brief  Length for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_LEN (1u)

/** \brief  Mask for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USR_Bits.SRDC */
#define IFX_MSC_USR_SRDC_OFF (5u)

/** \brief  Length for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_LEN (5u)

/** \brief  Mask for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_MSK (0x1fu)

/** \brief  Offset for Ifx_MSC_USR_Bits.UC */
#define IFX_MSC_USR_UC_OFF (16u)

/** \brief  Length for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_LEN (1u)

/** \brief  Mask for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_MSK (0x1u)

/** \brief  Offset for Ifx_MSC_USR_Bits.UFT */
#define IFX_MSC_USR_UFT_OFF (0u)

/** \brief  Length for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_LEN (3u)

/** \brief  Mask for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_MSK (0x7u)

/** \brief  Offset for Ifx_MSC_USR_Bits.URR */
#define IFX_MSC_USR_URR_OFF (1u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMSC_BF_H */
